app/controllers/permission_controller.rb

  def create
    auth = request.env['omniauth.auth']
    permission = current_user.permissions.find_by_provider_and_uid(
      auth['provider'],
      auth['uid']
    )
    if permission
      puts "Exists. Nothing to action."
    else
      current_user.permissions.create(
        :name => auth['info']['name'],
        :profile_image_url => auth['info']['image'],
        :provider => auth['provider'],
        :token => auth['credentials']['token'],
        :token_secret => auth['credentials']['secret'],
        :uid => auth['uid'],
        #:url => auth['urls'] # Needs work
        # auth hash schema https://github.com/intridea/omniauth/wiki/Auth-Hash-Schema
      )
---
SELECT  "permissions".* FROM "permissions"  WHERE "permissions"."user_id" = $1 AND "permissions"."provider" = 'twitter' AND "permissions"."uid" = '12782922' LIMIT 1  [["user_id", 1]]
INSERT INTO "permissions" ("created_at", "name", "profile_image_url", "provider", "token", "token_secret", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    @permission = current_user.permissions.find(params[:id])
    @permission.destroy
---
SELECT  "permissions".* FROM "permissions"  WHERE "permissions"."user_id" = $1 AND "permissions"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "permissions" WHERE "permissions"."id" = $1  [["id", 1]]