app/controllers/permissions_controller.rb

SELECT "permissions".* FROM "permissions"
---
  def index
    @permissions = Permission.all

INSERT INTO "permissions" ("created_at", "name", "profile_image_url", "provider", "token", "token_secret", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @permission = Permission.new(permission_params)

    respond_to do |format|
      if @permission.save

SELECT  "permissions".* FROM "permissions"  WHERE "permissions"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_permission
      @permission = Permission.find(params[:id])